Repository: Feyfolken/Coverlay
Catalog: Coverlay/PresentationLayer/Screens/AboutApp/Localization/*.lproj/AboutAppModuleLocalization.strings
Languages: ru

# screenTitleLabelText
source: About Coverlay
ru: О Coverlay

# generalDescriptionText
source: The application allows you to take a photo by overlaying any photo from the gallery on top of the main camera preview. Want to take a picture of your favorite landscape from the same vantage point, but at different times of the year? Or maybe find a place by photo? Probably repeat an old family photo years later? All this is now easy with Coverlay!
ru: Приложение позволяет вам производить фотосъёмку, используя при этом наложение любой фотографии из галереи поверх основного превью камеры. Хотите сфотографировать ваш любимый пейзаж с одной и той же точки, но в разные времена года? Найти место по фотографии? Повторить старое семейное фото спустя годы? Всё это теперь легко с Coverlay!

# authorshipText
source: Vadim Krasilnikov Â© 2021
ru: Вадим Красильников © 2021

# cameraCardMessage
source: Press the camera button on the main screen to start.
ru: Нажмите кнопку камеры на главном экране, чтобы начать.

# galleryCardMessage
source: Add any photo from your phone as an overlay on top of the camera preview by clicking the gallery button.
ru: Добавьте наложение любой фотографии с вашего смартфона поверх превью камеры, нажав на кнопку галереи.

# transparencyCardMessage
source: Use the transparency control slider to make the overlay as transparent as you like.
ru: Используйте слайдер контроля прозрачности, чтобы сделать наложение настолько прозрачным, насколько вам будет удобно.

# intersectionCardMessage
source: Aim the camera so that the images match as much as possible.
ru: Наводите камеру так, чтобы изображения максимально совпадали при наложении.

# gesturesCardMessage
source: Using gestures will allow you to move, resize and flip overlaying photo horizontally.
ru: Использование жестов позволит вам изменить размер и положение наложенного фото, а также отразить его по горизонтали.

# enableTransformationCardMessage
source: Pressing the lock button will fix the current position of the overlay photo by disabling gesture recognition. Spoiling a perfectly tuned overlay position by accidentally tapping it is no longer scary. Pressing it again will return the ability to change the shape, position and size of the overlaid image.
ru: Нажатие на кнопку замка позволит зафиксировать текущее положение наложенного фото, отключив распознавание жестов. Испортить идеально настроенное положение наложения случайным касанием теперь не страшно! Повторное нажатие вернёт возможность менять форму, положение и размер наложенного изображения.

# saveCardMessage
source: Successfully taken pictures can be saved to the gallery on the device.
ru: Удачные снимки можно сохранить в галерею на устройстве.
